app/views/devices/show.html.erb

SELECT `messages`.* FROM `messages` WHERE `messages`.`device_id` = 1
---
     var data_x = [], data_y =[];
                        console.log(outcome.messages.length);