app/controllers/devices_controller.rb

SELECT `devices`.* FROM `devices`
---
  def index
    @devices = Device.all

SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 1 LIMIT 1
---
  def show
    @device = Device.find(params[:id])

SELECT  `devices`.* FROM `devices` WHERE `devices`.`id` = 2 LIMIT 1
SELECT `messages`.* FROM `messages` WHERE `messages`.`device_id` = 2 AND (DATE(polled_at) BETWEEN '2016-09-30 00:00' AND '2016-10-03 00:00')
---
  def get_data
    if params[:start_date].present?
      @messages = Device.find(params[:device_id]).messages.where("DATE(polled_at) BETWEEN ? AND ?",params[:start_date],params[:end_date])